{
	"terms": [
        {
            "id": 1,
            "ruTerm": "Язык программирования",
            "def": "Формальный язык, содержащий набор инструкций, которые производят различные виды выходных данных. Языки программирования используются в компьютерном программировании для реализации алгоритмов.",
            "engTerm": "Programming Language"
        },
        {
            "id": 2,
            "ruTerm": "Python",
            "def": "Язык программирования, который широко используется в интернет-приложениях, разработке программного обеспечения, науке о данных и машинном обучении (ML). Разработчики используют Python, потому что он эффективен, прост в изучении и работает на разных платформах.",
            "engTerm": "Python"
        },
        {
            "id": 3,
            "ruTerm": "JavaScript",
            "def": "Язык программирования, который используют разработчики для создания интерактивных веб-страниц. JavaScript является языком программирования при разработки скриптов для выполнения на стороне клиента, что делает его одной из базовых технологий во всемирной сети Интернет. По мере развития языка, разработчики JavaScript создали библиотеки, фреймворки и практики программирования и начали использовать его за пределами веб-браузеров. Сегодня JavaScript можно использовать для разработки как на стороне клиента, так и на стороне сервера.",
            "engTerm": "JavaScript"
        },
        {
            "id": 4,
            "ruTerm": "Фреймворк",
            "def": "Программная платформа, которая упрощает разработку программного продукта, определяет структуру проекта и помогает удобно объединять в нём разные компоненты. От выбора фреймворка на проекте зависит многое: зарплаты и возможности найма разработчиков, процессы, технологии и скорость разработки.",
            "engTerm": "Framework"
        },
        {
            "id": 5,
            "ruTerm": "Машинное обучение",
            "def": "Научная область ИИ, которая изучает компьютерные алгоритмы, позволяющие компьютерным программам автоматически совершенствоваться по мере накопления опыта.",
            "engTerm": "Machine Learning"
        },
        {
            "id": 6,
            "ruTerm": "Набор данных",
            "def": "Набор структурированных данных, предназначенных для обучения моделей нейронных сетей.",
            "engTerm": "Dataset"
        },
        {
            "id": 7,
            "ruTerm": "Очистка данных",
            "def": "Обеспечение качества наборов данных. Для нахождения и исправления ошибочных записей данных в базе данных, наборы данных тщательно проверяются.",
            "engTerm": "Data Cleaning"
        },
        {
            "id": 8,
            "ruTerm": "Модель",
            "def": "Математическое представление системы или процесса, которое используется для прогнозирования или принятия решений.",
            "engTerm": "Model"
        },
        {
            "id": 9,
            "ruTerm": "Обучение модели",
            "def": "Процесс использования набора маркированных данных для настройки параметров модели, чтобы она могла делать точные прогнозы.",
            "engTerm": "Model training"
        },
        {
            "id": 10,
            "ruTerm": "Переобучение",
            "def": "Ситуация, когда модель изучила шум в обучающих данных, а не основной паттерн, и в результате плохо работает на новых данных.",
            "engTerm": "Overfitting"
        },
        {
            "id": 11,
            "ruTerm": "Недообучение",
            "def": "Ситуация, когда модель не изучила базовую закономерность в обучающих данных и не способна делать точные прогнозы.",
            "engTerm": "Underfitting"
        },
        {
            "id": 12,
            "ruTerm": "Нейронная сеть",
            "def": "Структура соединенных между собой нейронов, которая характеризуется топологией, свойствами узлов, а также правилами обучения или тренировки для получения желаемого выходного сигнала.",
            "engTerm": "Neural network"
        },
        {
            "id": 13,
            "ruTerm": "Обработка естественного языка",
            "def": "Научная отрасль искусственного интеллекта, которая занимается развитием понимания, интерпретации и применения компьютерами человеческого языка.",
            "engTerm": "Natural Language Processing"
        },
        {
            "id": 14,
            "ruTerm": "Токенизация",
            "def": "Процесс разбиения предложения или фрагмента текста на более мелкие единицы, называемые лексемами, которые могут быть словами, фразами или предложениями.",
            "engTerm": "Tokenization"
        },
        {
            "id": 15,
            "ruTerm": "Стемминг",
            "def": "Процесс сокращения слова до его базовой формы. Это делается для уменьшения размерности данных и группировки слов с одинаковым значением.",
            "engTerm": "Stemming"
        },
        {
            "id": 16,
            "ruTerm": "Лемматизация",
            "def": "Процесс сокращения слова до его базовой формы, или леммы. Как и стемминг, это делается для уменьшения размерности данных и группировки слов с одинаковым значением. Лемматизация считается более точной, чем стемминг, поскольку учитывает контекст слова и его грамматическую структуру.",
            "engTerm": "Lemmatization"
        },
        {
            "id": 17,
            "ruTerm": "Мешок слов",
            "def": "Представление текста, в котором каждое уникальное слово представлено числом, а текст представлен в виде вектора этих чисел. Это метод преобразования текста в числовую форму, который может быть использован для решения различных задач машинного обучения и NLP.",
            "engTerm": "Bag of words"
        },
        {
            "id": 18,
            "ruTerm": "Встраивание слов",
            "def": "Метод представления слов в виде высокоразмерных векторов, которые передают смысл и контекст слов. Эти векторы могут использоваться в качестве входных данных для различных моделей машинного обучения.",
            "engTerm": "Embedding words"
        }
        ]
}